# Pandas

In [2]:
import pandas
print(pandas.__version__)

1.0.5

# Series

In [5]:
population_dict={"China":984567842,"India":964533267,"Russia":9056957423,"America":854124345}
#This is Dictionary
print(population_dict)
population=pandas.Series(population_dict)
#This is series
print(population)

{'China': 984567842, 'India': 964533267, 'Russia': 9056957423, 'America': 854124345}
China       984567842
India       964533267
Russia     9056957423
America     854124345
dtype: int64

# Indexing and Slicing in Series

In [28]:
population_dict={"China":984567842,"India":964533267,"Russia":9056957423,"America":854124345}
population=pandas.Series(population_dict)
#using index values in series.
print(population[0])
print(population[1])
print(population[2])
print(population[3])
#using keys in dictionaries.
print() #this is used for differentiation in output purposes.
print(population["China"])
print(population["India"])
print(population["Russia"])
print(population["America"])
print()
#using indexing 
print(population[0:3])
print()
print(population["China":"America"])

984567842
964533267
9056957423
854124345

984567842
964533267
9056957423
854124345

China      984567842
India      964533267
Russia    9056957423
dtype: int64

China       984567842
India       964533267
Russia     9056957423
America     854124345
dtype: int64

# Create Series using List

In [29]:
pandas.Series([2,4,6,8]) #create series.

0    2
1    4
2    6
3    8
dtype: int64

In [36]:
pandas.Series(30,index=["num1"])  #give index value.

num1    30
dtype: int64

In [40]:
pandas.Series(50,index=[111,222,333])

111    50
222    50
333    50
dtype: int64

# Dataframes

In [61]:
population_dict={"China":984567842,"India":964533267,"Russia":9056957423,"America":854124345}
president_dict={"China":"Xi Jinping","India":"Narendra Modi","Russia":"Vladimir Putin","America":"Joe Biden"}
presidentseries=pandas.Series(president_dict)  #convert Dict to Series
populationseries=pandas.Series(population_dict)  #convert Dict to Series
pandas.DataFrame(populationseries, columns=["Popultion"])  #Columns is a function.

          Popultion
China     984567842
India     964533267
Russia   9056957423
America   854124345

# List Comprehension

In [64]:
[{'a':i,'b':i+1,'c':i+2} for i in range(3)]

[{'a': 0, 'b': 1, 'c': 2}, {'a': 1, 'b': 2, 'c': 3}, {'a': 2, 'b': 3, 'c': 4}]

# Indexers : loc and iloc

In [71]:
data=pandas.Series(['a','b','c'],index=[1,2,3])
print(data[1])     #indexing -> pandas uses Explicit Index.
print(data[1:3])   #slicing -> pandas uses Implicit Index.
#this can be solved using loc and iloc

a
2    b
3    c
dtype: object

In [74]:
# loc -> Explicit.
data=pandas.Series(['a','b','c'],index=[1,2,3])
print(data.loc[1])  
print(data.loc[1:3])

a
1    a
2    b
3    c
dtype: object

In [75]:
# iloc -> Implicit.
data=pandas.Series(['a','b','c'],index=[1,2,3])
print(data.iloc[1])  
print(data.iloc[1:3])

b
2    b
3    c
dtype: object

# Comma Spread Values (CSV)

In [79]:
data=pandas.read_csv("record.csv")
data.head()  #picks first 5 datas
# https://docs.google.com/spreadsheets/d/14HJVW6ivPkcflradtLrR3X0JHp9ai9eaN7xKdsEwkHY/edit#gid=0

         Name  Tamil  English  Maths  Physics  Chemistry
0        Alan     98       99     93       95         96
1     Britney     92       95     98       96         99
2      Mathew     90       97     99       90         91
3       Kevin     98       94     95       99         90
4  Willaimson     99       94     97       99         98

In [80]:
data=pandas.read_csv("record.csv")
data.tail()  #picks last 5 datas

         Name  Tamil  English  Maths  Physics  Chemistry
1     Britney     92       95     98       96         99
2      Mathew     90       97     99       90         91
3       Kevin     98       94     95       99         90
4  Willaimson     99       94     97       99         98
5        Zach     97       92     91       94         99

In [81]:
data=pandas.read_csv("record.csv")
data.head(2)  #picks first two datas

      Name  Tamil  English  Maths  Physics  Chemistry
0     Alan     98       99     93       95         96
1  Britney     92       95     98       96         99

In [82]:
data=pandas.read_csv("record.csv")
data.tail(2)  #picks last two datas

         Name  Tamil  English  Maths  Physics  Chemistry
4  Willaimson     99       94     97       99         98
5        Zach     97       92     91       94         99

In [83]:
data=pandas.read_csv("record.csv")
data.sample()   #picks random datas

      Name  Tamil  English  Maths  Physics  Chemistry
1  Britney     92       95     98       96         99

In [88]:
data=pandas.read_csv("record.csv")
data['Physics']   #prints specific column and each column is a series.

0    95
1    96
2    90
3    99
4    99
5    94
Name: Physics, dtype: int64

In [90]:
data=pandas.read_csv("record.csv")
data.iloc[:5,:3]  #indexing

         Name  Tamil  English
0        Alan     98       99
1     Britney     92       95
2      Mathew     90       97
3       Kevin     98       94
4  Willaimson     99       94

# Conversion To Numpy

In [95]:
data=pandas.read_csv("record.csv")
data.values  #values is an attribute. EDA & Used in Machine Learning.

array([['Alan', 98, 99, 93, 95, 96],
       ['Britney', 92, 95, 98, 96, 99],
       ['Mathew', 90, 97, 99, 90, 91],
       ['Kevin', 98, 94, 95, 99, 90],
       ['Willaimson', 99, 94, 97, 99, 98],
       ['Zach', 97, 92, 91, 94, 99]], dtype=object)

In [96]:
type(data.values)

numpy.ndarray

In [97]:
data.describe()   #describe function gives summary of all numeric columns.

           Tamil    English      Maths    Physics  Chemistry
count   6.000000   6.000000   6.000000   6.000000   6.000000
mean   95.666667  95.166667  95.500000  95.500000  95.500000
std     3.723797   2.483277   3.082207   3.391165   4.037326
min    90.000000  92.000000  91.000000  90.000000  90.000000
25%    93.250000  94.000000  93.500000  94.250000  92.250000
50%    97.500000  94.500000  96.000000  95.500000  97.000000
75%    98.000000  96.500000  97.750000  98.250000  98.750000
max    99.000000  99.000000  99.000000  99.000000  99.000000

In [98]:
data['English'].sum()   #prints the sum of English

571

In [99]:
data['Physics'].mean()  #prints the mean of Physics.

95.5

In [101]:
data.shape

(6, 6)

In [105]:
data['Total Score']=data['Tamil']+data['English']+data['Maths']+data['Physics']+data['Chemistry']
data

         Name  Tamil  English  Maths  Physics  Chemistry  Total Score
0        Alan     98       99     93       95         96          481
1     Britney     92       95     98       96         99          480
2      Mathew     90       97     99       90         91          467
3       Kevin     98       94     95       99         90          476
4  Willaimson     99       94     97       99         98          487
5        Zach     97       92     91       94         99          473

# Info Function

In [106]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         6 non-null      object
 1   Tamil        6 non-null      int64
 2   English      6 non-null      int64
 3   Maths        6 non-null      int64
 4   Physics      6 non-null      int64
 5   Chemistry    6 non-null      int64
 6   Total Score  6 non-null      int64
dtypes: int64(6), object(1)
memory usage: 464.0+ bytes

# Round Off Function

In [107]:
import numpy
data['Total Score']= data['Total Score']*numpy.pi
data

         Name  Tamil  English  Maths  Physics  Chemistry  Total Score
0        Alan     98       99     93       95         96  1511.106066
1     Britney     92       95     98       96         99  1507.964474
2      Mathew     90       97     99       90         91  1467.123769
3       Kevin     98       94     95       99         90  1495.398103
4  Willaimson     99       94     97       99         98  1529.955622
5        Zach     97       92     91       94         99  1485.973325

In [108]:
data['Total Score']=round(data['Total Score'],3) #round off by 3 decimal numbers.
data

         Name  Tamil  English  Maths  Physics  Chemistry  Total Score
0        Alan     98       99     93       95         96     1511.106
1     Britney     92       95     98       96         99     1507.964
2      Mathew     90       97     99       90         91     1467.124
3       Kevin     98       94     95       99         90     1495.398
4  Willaimson     99       94     97       99         98     1529.956
5        Zach     97       92     91       94         99     1485.973